#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_iam_role_policy.cloudwatch will be destroyed
  - resource "aws_iam_role_policy" "cloudwatch" {
      - id     = "aws-lambda-cost:aws-lambda-cost-cloudwatch" -> null
      - name   = "aws-lambda-cost-cloudwatch" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "cloudwatch:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "aws-lambda-cost" -> null
    }

  # module.aws-lambda-cost.aws_iam_role_policy.cloudwatch_log will be created
  + resource "aws_iam_role_policy" "cloudwatch_log" {
      + id     = (known after apply)
      + name   = "aws-lambda-cost-cloudwatch-log"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "aws-lambda-cost"
    }

  # module.aws-lambda-cost.aws_iam_role_policy.cloudwatch_sts will be created
  + resource "aws_iam_role_policy" "cloudwatch_sts" {
      + id     = (known after apply)
      + name   = "aws-lambda-cost-cloudwatch-sts"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "cloudwatch:Get*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sts:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "aws-lambda-cost"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-02-29T09:10:28.087+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "DU658dBnDFI3lnrFlLyPAYRkvM0N+Nup5XjQSuTp1JI=" -> (known after apply)
        source_code_size               = 951
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_POST_URL" = "https://hooks.slack.com/services/XXXXXXXXXXXXXXXXXXXXXXXXXXX"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
